🔸 제2장 – 민주주의 구조의 한계
현대 민주주의는 개인의 의사가 제도에 반영되는 체제로 여겨진다.
그러나 현실적으로 투표로 자신의 의지가 정확히 반영될 가능성은 매우 낮다.
개인은 다수결로 인해 원치 않는 체제에 강제적으로 소속될 수 있으며, 소수의 희생이 필연적이다.

국민은 대표자에게 권리를 위임하지만, 그 대표는 최대 다수의 지지를 얻는 데 집중한다.

집단 지성이 성립하기 위해서는 제안, 평가, 수정 이 3가지 요소가 반복되어야 한다.
하지만 민주주의에서의 투표는 제안과 평가만으로 이루어지고, 수정이 이루어지지 않는다.
또한 무기명으로 평등한 표를 행사하므로 적절한 평가가 이루어지기 어렵다.

즉, 집단 지성에서 다수의 의견을 취합해 서로 비교하며 더 나은 결론은 찾는게 아닌 단순히 다수가 원하는 결론을 내리는 것에 지나지 않는다. 
이러한 판단 과정에서 소수의 입장은 고려되지 않으며, 민주주의는 구조적으로 소수를 다수의 이익을 위해 기능적으로 희생시키는 체제가 된다.
반대로 소수를 위한 행동은 다수의 이득이 반하며, 이는 사회의 정책의 낮은 효율성을 야기한다.

또한, 다수의 국민이 이 계약이 위반되었다고 판단하는 경우, 국민은 체제 전환을 선택할 수 있다.
이것은 정치적 혼란의 가능성을 의미하며, 민주주의의 불안정한 경기성을 나타낸다.
