모든 인간에게는 보편적 자유가 부여되며, 이는 개인의 책임이다.
자유로운 인간은 어떠한 사고에도 구애받지 않는다.
개인은 효율적인 분업을 위해 집단을 구성한다.
자유는 개인에 경우에만 정당하며, 집단에 속한 인간의 자유는 정당하지 않다.
집단에서 보장하는 구성원의 자유는 보편적 자유가 아니며 지배하에 보장되는 제한적 자유이다.
민주주의 또한 집단의 지배이자 개인의 제한적 자유에 해당한다.
집단이 보장하는 제한적 자유는 집단이 책임진다. 
모든 집단은 지배하에 성립되며, 개인은 집단의 지배를 받는다.
인간은 계약을 통해 집단에 속할 수 있으며, 소속한 집단으로부터 효율적인 분업을 제공받는다.
집단의 지배의 정당성은 계약의 자유를 기반으로 한다.
자유 계약이 보장된 집단의 존속은 집단의 지배의 정당성을 보장한다.
집단은 구성원의 존재를 바탕으로 존속한다.
국가는 지도자가 관리하는 집단이다.
국가는 자유로운 계약을 바탕으로 국민을 지배할 수 있다.
이러한 지배를 바탕으로 국가는 조세를 행한다.
조세는 국가의 존속을 유지한다.
정당한 집단은 자유로운 계약을 바탕으로 한 지배로 이루어진다.
강제적인 계약을 바탕으로 이루어진 집단은 정당한 집단이 아니다.
국제 사회는 정당한 집단들의 상호 존중을 바탕으로 이루어진다.
상호 존중은 정당한 집단에 해당되며, 정당하지 않은 집단에는 해당되지 않는다.
국제 사회에서 국가의 안전은 해당 국가의 정당성을 조건으로 보장된다.
구성원의 계약의 자유가 보장되지 않은 집단은 정당하지 않은 집단이다.
국가의 정당성은 국민의 계약의 자유를 바탕으로 하며, 계약의 자유가 없는 국가는 정당성이 없는 국가이다.
정당한 국가와 강제적인 계약을 바탕으로 착취당하는 국민은 상호 합의 하에 새로운 계약을 체결할 권리가 있다.
정당한 국가는 부당한 국가의 국민과 자유롭게 새로운 계약을 맺어 군림할 권리가 있다.
또한 정당한 국가는 새로운 계약을 맺은 구성원을 지배할 권리가 있으며, 제한적 자유를 제공할 권리가 있다.
마찬가지로 새로운 계약을 맺은 구성원은 제한적 자유를 제공받을 권리가 있으며, 지배당할 의무가 있다.
이때 새로운 계약을 바탕으로 지배의 권리와 제한적 자유 제공의 의무는 부당한 국가에서 정당한 국가로 위임된다. 
정당한 국가는 상호 존중에 구애받지 않고 부당한 국가로부터 구성원을 보호한다.
다만 국가는 계약하지 않은 개인의 보편적 자유의 보장을 책임지지 않으며, 개인의 보편적 자유의 책임은 개인에게 있다.
또한 국가와 국민의 계약은 어디까지나 상호 합의 하에 이루어 지는 것이며 강제성이 없다.
지도자는 자신의 이익을 바탕으로 정책이라는 상품을 생산한다.
이러한 정책이라는 상품이 자유롭게 거래되는 완전 거래 시장을 국제 사회라고 한다.
국제 사회는 완전 거래 시장의 유지를 위해 노력할 의무가 있다.
완전 거래는 국가와 국민의 자유로운 계약체결을 포함하며, 이는 국가의 보편적 자유의 책임을 부정한다.
완전 거래 시장에서 다양한 국가와 국민은 다양한 가치를 가진다.
